@echo off

rem 编译src/CreateBigInfix文件，生成长中缀表达式
rem ============================================================
javac -d bin src/CreateBigInfix.java
rem ============================================================

rem 编译Postfix.java文件
rem ============================================================
javac -d bin src/Postfix.java
rem ============================================================

rem 不断循环，从5000开始，每次增加100，直至10000
rem ============================================================
for /l %%i in (2000,20,3800) do (
	rem 运行编译后的文件，并传入参数，用于规定主函数循环次数
	rem ========================================================
	cd bin
	java CreateBigInfix %%i
	rem ========================================================

	rem Postfix读入longInfix文件，进行测试
	rem ========================================================
	java -Xmx1024m -XX:PermSize=256m -XX:MaxPermSize=512m Postfix < ../InfixOutput.txt
	rem ========================================================
	cd ..

	rem 删除生成后的InfixOutput文件
    rem ============================================================
    del InfixOutput.txt
    rem ============================================================
	)
rem ============================================================

pause
@echo on
